<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use DB;
use Carbon\Carbon;

class RecordItemsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data=array(
            array(
                'record'=>'1',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:06',
                'end' => '2022-05-05 04:41:16',
                'content'=>'日本国民',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'1',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:16',
                'end' => '2022-05-05 04:41:26',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'2',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:36',
                'end' => '2022-05-05 04:41:16',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'2',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:16',
                'end' => '2022-05-05 04:41:26',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'3',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:06',
                'end' => '2022-05-05 04:41:16',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'3',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:16',
                'end' => '2022-05-05 04:41:26',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '57',
                'new_ts' => Carbon::now(),
                'upd_by' => '57',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'4',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:06',
                'end' => '2022-05-05 04:41:16',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '58',
                'new_ts' => Carbon::now(),
                'upd_by' => '58',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'4',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:16',
                'end' => '2022-05-05 04:41:26',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '58',
                'new_ts' => Carbon::now(),
                'upd_by' => '58',
                'upd_ts' => Carbon::now()
            ),
            array(
                'record'=>'5',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:06',
                'end' => '2022-05-05 04:41:16',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=> '58',
                'new_ts' => Carbon::now(),
                'upd_by' => '58',
                'upd_ts' => Carbon::now()
            ),

            array(
                'record'=>'5',
                'type'=>'X3633',
                'begin' => '2022-05-05 04:41:16',
                'end' => '2022-05-05 04:41:26',
                'content'=>'日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。',
                'chg'=>'Y',
                'new_by'=>'58',
                'new_ts' => Carbon::now(),
                'upd_by' => '58',
                'upd_ts' => Carbon::now()
            ),
            
        );

        DB::table('record_items')->insert($data);
    }
}
